---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.BendingDetailDisplayParametersOptions.ByValue
enum: Autodesk.Revit.DB.Structure.BendingDetailDisplayParametersOptions
source: html/a5354b93-7e81-67a7-4e60-b59d0b631461.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailDisplayParametersOptions.ByValue

Dimensions that are shown will be labeled using the parameters values.